Tekla Open API Reference for Tekla Structures 2025
BasePoint Methods
The BasePoint type exposes the following members.
Methods
Name | Description
ConvertFromBasePoint(Point)
 Converts the given point from this base point to local point.
ConvertFromBasePoint(BasePoint, Point)
 Converts the given base point point to local point.
ConvertToBasePoint(Point)
 Converts the given local point to this base point.
ConvertToBasePoint(BasePoint, Point)
 Converts the given local point to given base point.
Delete
 Deletes the base point from the model database.
GetCompoundPlaneAngleLatitude
 Gets the Latitude as a compound plane angle.
GetCompoundPlaneAngleLongitude
 Gets the Longitude as a compound plane angle.
GetCoordinateSystem
 Gets the coordinate system of the base point.
Insert
 Inserts the base point into the model database.
Modify
 Modifies the base point in the model database.
SetAsCurrent
 Sets this base point as current base point point until the token is disposed of. Can be used for example when retrieving report values according to this base point.
Top
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace